Tekla Open API Reference for Tekla Structures 2025
AlongLinePlacingType Constructor
 Creates a new along line placing type instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AlongLinePlacingType()
Public Sub New
See Also
Reference
AlongLinePlacingType Class
Tekla.Structures.Drawing Namespace